https://github.com/okovtun/BV_224
https://www.youtube.com/watch?v=ahdr2uT2Obk&list=PLeqyOOqxeiINZ37jcEwuwV6LoJmVZ1Zdo
https://meet.google.com/mho-khdw-fhj

///////////////////////////////////////////////////////////////////////////
///////////////////			Control structures		///////////////////////
///////////////////////////////////////////////////////////////////////////

TODO:
1. Написать программу, которая по введенной температуре воздуха определяет
   на улице тепло, или же холодно. 
   Если введенная температура выше нуля - на улице тепло, 
   в противном случае - холодно.
2. С клавиатуры вводится число. 
   Если введенно число в промежутке от 0 до 10 - цель поражена,
   в противном случае - Вы промахнулись.
3. Написать программу "Калькулятор", которая принимает выражение вида:
   2 + 3
   и выводит результат операции
   2 + 3 = 5.
   Если пользователь ввел некорректную операцию, то на экран выводится ошибка:
   Error: No operation.
   2@3
   2#4


///////////////////////////////////////////////////////////////////////////
///////////////////				OPERATORS			///////////////////////
///////////////////////////////////////////////////////////////////////////

TODO:
1. Что будет выведено на экран? (Посчитать без компилятора)
	int i = 3;
	i = ++i + ++i;
	cout << i << endl;
2. Что будет выведено на экран? (Посчитать без компилятора)
	int i = 3;
	i = ++i + 1 + ++i * 2;
	cout << i << endl;
3. Что будет выведено на экран? (Посчитать без компилятора)
	int i = 3;
	i = ++i + 1 + ++i *= 2;
	cout << i << endl;
4. Что будет выведено на экран? (Посчитать без компилятора)
	int i = 3;
	i += ++i + 1 + ++i *= 2;
	cout << i << endl;
5. Что будет выведено на экран? (Посчитать без компилятора)
	int i = 3;
	i *= ++i + 1 + ++i += 2;
	cout << i << endl;


DONE:
Поменять местами две переменные.
	int a = 2, b = 3;
	cout << a << "\t" << b << endl;
	//код, который меняет переменные 'a' и 'b' местами.
	cout << a << "\t" << b << endl;

DONE:
0. Выучить типы данных!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
1. Почитать:https://github.com/okovtun/BV_224/blob/master/DataTypes/DataTypes.pdf
2. Попытаться решить задачи: https://github.com/okovtun/BV_224/blob/master/DataTypes/DataTypes/VariablesTask.pdf

DONE:
1. Выучить теорию!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
2. Вывести в окно консоли стишок "В лесу родилась Ёлочка".
   Стишок должен быть выровнен по середине окна консоли,
   а так же его куплеты должны быть разделены пустой строкой.